THREADS = {
    "Гамма": {
        "Красный": "638", "Оранжевый": "274", "Желтый": "965", "Зеленый": "332", "Голубой": "732",
        "Синий": "665", "Фиолетовый": "463", "Розовый": "621", "Черный": "552", "Белый": "999",
        "Бежевый": "224", "Коричневый": "786"
    },
    "Анкор": {
        "Красный": "63", "Оранжевый": "23", "Желтый": "78", "Зеленый": "45", "Голубой": "98",
        "Синий": "74", "Фиолетовый": "52", "Розовый": "92", "Черный": "33", "Белый": "00",
        "Бежевый": "48", "Коричневый": "86"
    },
    "Финка": {
        "Красный": "098", "Оранжевый": "043", "Желтый": "076", "Зеленый": "021", "Голубой": "032",
        "Синий": "056", "Фиолетовый": "067", "Розовый": "048", "Черный": "052", "Белый": "099",
        "Бежевый": "022", "Коричневый": "078"
    }
}

NEEDLES = {
    "DMC": {"Тонкие": "232", "Средние": "242", "Толстые": "252"},
    "Clover": {"Тонкие": "020", "Средние": "040", "Толстые": "060"},
    "Aurifil": {"Тонкие": "111", "Средние": "222", "Толстые": "333"}
}

CANVAS = {
    "Anchor": {"Мелкая": "11*11", "Средняя": "33*33", "Крупная": "55*55"},
    "Risa": {"Мелкая": "01*01", "Средняя": "04*04", "Крупная": "09*09"}
}